{
  "id": "1338",
  "name": "Improper Protections Against Hardware Overheating",
  "abstraction": "Base",
  "structure": "Simple",
  "status": "Draft",
  "description": "A hardware device is missing or has inadequate protection features to prevent overheating.",
  "extended_description": "\n\t\t\t\t\u003cxhtml:p\u003eHardware, electrical circuits, and semiconductor silicon have thermal side effects, such that some of the energy consumed by the device gets dissipated as heat and increases the temperature of the device. For example, in semiconductors, higher-operating frequency of silicon results in higher power dissipation and heat. The leakage current in CMOS circuits increases with temperature, and this creates positive feedback that can result in thermal runaway and damage the device permanently.\u003c/xhtml:p\u003e\n\t\t\t\t\u003cxhtml:p\u003eAny device lacking protections such as thermal sensors, adequate platform cooling, or thermal insulation is susceptible to attacks by malicious software that might deliberately operate the device in modes that result in overheating. This can be used as an effective denial of service (DoS) or permanent denial of service (PDoS) attack.\u003c/xhtml:p\u003e\n\t\t\t\t\u003cxhtml:p\u003eDepending on the type of hardware device and its expected usage, such thermal overheating can also cause safety hazards and reliability issues. Note that battery failures can also cause device overheating but the mitigations and examples included in this submission cannot reliably protect against a battery failure. \u003c/xhtml:p\u003e\n\t\t\t\t\u003cxhtml:p\u003eThere can be similar weaknesses with lack of protection from attacks based on overvoltage or overcurrent conditions. However, thermal heat is generated by hardware operation and the device should implement protection from overheating.\u003c/xhtml:p\u003e\n\t\t\t",
  "related_weaknesses": [
    {
      "nature": "ChildOf",
      "cweid": "693",
      "view_id": "1000"
    }
  ],
  "applicable_platforms": {
    "language": [
      {
        "class": "Language-Independent",
        "prevalence": "Undetermined"
      }
    ],
    "technology": [
      {
        "prevalence": "Undetermined",
        "name": "Power Management Hardware"
      },
      {
        "prevalence": "Undetermined",
        "name": "Processor Hardware"
      },
      {
        "class": "Technology-Independent",
        "prevalence": "Undetermined"
      }
    ],
    "operating_system": [
      {
        "class": "OS-Independent",
        "prevalence": "Undetermined"
      }
    ],
    "architecture": [
      {
        "class": "Architecture-Independent",
        "prevalence": "Undetermined"
      }
    ]
  },
  "modes_of_introduction": [
    {
      "phase": "Architecture and Design"
    },
    {
      "phase": "Implementation",
      "note": [
        "Such issues could be introduced during hardware architecture, design or implementation."
      ]
    }
  ],
  "common_consequences": [
    {
      "scope": [
        "Availability"
      ],
      "impact": [
        "DoS: Resource Consumption (Other)"
      ],
      "likelihood": "High"
    }
  ],
  "potential_mitigations": [
    {
      "phase": [
        "Architecture and Design"
      ],
      "description": [
        "Temperature maximum and minimum limits should be enforced using thermal sensors both in silicon and at the platform level."
      ]
    },
    {
      "phase": [
        "Implementation"
      ],
      "description": [
        "The platform should support cooling solutions such as fans that can be modulated based on device-operation needs to maintain a stable temperature."
      ]
    }
  ],
  "demonstrative_examples": [
    {
      "text": "\n\t\t\t\t\t\u003cIntro_Text\u003eMalicious software running on a core can execute instructions that consume maximum power or increase core frequency. Such a power-virus program could execute on the platform for an extended time to overheat the device, resulting in permanent damage.\u003c/Intro_Text\u003e\n\t\t\t\t\t\u003cBody_Text\u003eExecution core and platform do not support thermal sensors, performance throttling, or platform-cooling countermeasures to ensure that any software executing on the system cannot cause overheating past the maximum allowable temperature.\u003c/Body_Text\u003e\n\t\t\t\t\t\u003cBody_Text\u003eThe platform and SoC should have failsafe thermal limits that are enforced by thermal sensors that trigger critical temperature alerts when high temperature is detected. Upon detection of high temperatures, the platform should trigger cooling or shutdown automatically.\u003c/Body_Text\u003e\n\t\t\t\t"
    }
  ],
  "references": [
    {
      "reference_id": "REF-1156",
      "author": [
        "Leonid Grustniy"
      ],
      "title": "Loapi--This Trojan is hot!",
      "url": "https://www.kaspersky.com/blog/loapi-trojan/20510/ ",
      "publication_year": "2017",
      "publication_month": "--12"
    }
  ],
  "content_history": {
    "submission": {
      "submission_name": "Arun Kanuparthi, Hareesh Khattri, Parbati Kumar Manna",
      "submission_organization": "Intel Corporation",
      "submission_date": "2020-05-29T00:00:00Z"
    },
    "modification": [
      {
        "modification_name": "CWE Content Team",
        "modification_organization": "MITRE",
        "modification_date": "2022-04-28T00:00:00Z",
        "modification_comment": "updated Applicable_Platforms, Relationships"
      },
      {
        "modification_name": "CWE Content Team",
        "modification_organization": "MITRE",
        "modification_date": "2022-06-28T00:00:00Z",
        "modification_comment": "updated Applicable_Platforms"
      }
    ]
  },
  "detection_methods": [
    {
      "method": "Dynamic Analysis with Manual Results Interpretation",
      "description": "Dynamic tests should be performed to stress-test temperature controls.",
      "effectiveness": "High"
    },
    {
      "method": "Architecture or Design Review",
      "description": "Power management controls should be part of Architecture and Design reviews.",
      "effectiveness": "High"
    }
  ]
}
