{
  "vid": "4ab413ea-66ce-11e0-bf05-d445f3aa24f0",
  "topic": "krb5 -- MITKRB5-SA-2011-002, KDC vulnerable to hang when using LDAP back end",
  "description": "\n\t\u003cp\u003eAn advisory published by the MIT Kerberos team says:\u003c/p\u003e\n\t\u003cblockquote cite=\"http://web.mit.edu/kerberos/advisories/MITKRB5-SA-2011-002.txt\"\u003e\n\t  \u003cp\u003eThe MIT krb5 Key Distribution Center (KDC) daemon is vulnerable\n\t    to denial of service attacks from unauthenticated remote\n\t    attackers.  CVE-2011-0281 and CVE-2011-0282 occur only in KDCs\n\t    using LDAP back ends, but CVE-2011-0283 occurs in all krb5-1.9\n\t    KDCs.\u003c/p\u003e\n\t  \u003cp\u003eExploit code is not known to exist, but the vulnerabilities are\n\t    easy to trigger manually.  The trigger for CVE-2011-0281 has\n\t    already been disclosed publicly, but that fact might not be\n\t    obvious to casual readers of the message in which it was\n\t    disclosed.  The triggers for CVE-2011-0282 and CVE-2011-0283\n\t    have not yet been disclosed publicly, but they are also\n\t    trivial.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2011-0281: An unauthenticated remote attacker can cause a KDC\n\t    configured with an LDAP back end to become completely unresponsive\n\t    until restarted.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2011-0282: An unauthenticated remote attacker can cause a KDC\n\t    configured with an LDAP back end to crash with a null pointer\n\t    dereference.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2011-0283: An unauthenticated remote attacker can cause a\n\t    krb5-1.9 KDC with any back end to crash with a null pointer\n\t    dereference.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "krb5",
      "range": [
        {
          "lt": "1.7.2",
          "ge": "1.7"
        },
        {
          "ge": "1.8",
          "le": "1.8.4"
        },
        {
          "eq": "1.9"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2011-02-08T00:00:00Z",
    "entry": "2011-04-14T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "http://web.mit.edu/kerberos/advisories/MITKRB5-SA-2011-002.txt"
    },
    {
      "source": "CVE",
      "text": "CVE-2011-0281"
    },
    {
      "source": "CVE",
      "text": "CVE-2011-0282"
    },
    {
      "source": "CVE",
      "text": "CVE-2011-0283"
    }
  ]
}
