{
  "vid": "4b98613c-0078-11e9-b05b-00e04c1ea73d",
  "topic": "wordpress -- multiple issues",
  "description": "\n\t\u003cp\u003ewordpress developers reports:\u003c/p\u003e\n\t\u003cblockquote cite=\"https://wordpress.org/news/2018/12/wordpress-5-0-1-security-release/\"\u003e\n\t  \u003cp\u003eWordPress versions 5.0 and earlier are affected by the following bugs, which are\n\t    fixed in version 5.0.1. Updated versions of WordPress 4.9 and older releases are\n\t    also available, for users who have not yet updated to 5.0.\u003c/p\u003e\n\t  \u003cp\u003eKarim El Ouerghemmi discovered that authors could alter meta data to delete files\n\t    that they weren’t authorized to.\u003c/p\u003e\n\t  \u003cp\u003eSimon Scannell of RIPS Technologies discovered that authors could create posts of\n\t    unauthorized post types with specially crafted input.\u003c/p\u003e\n\t  \u003cp\u003eSam Thomas discovered that contributors could craft meta data in a way that resulted\n\t    in PHP object injection.\u003c/p\u003e\n\t  \u003cp\u003eTim Coen discovered that contributors could edit new comments from higher-privileged\n\t    users, potentially leading to a cross-site scripting vulnerability.\u003c/p\u003e\n\t  \u003cp\u003eTim Coen also discovered that specially crafted URL inputs could lead to a cross-site\n\t    scripting vulnerability in some circumstances. WordPress itself was not affected,\n\t    but plugins could be in some situations.\u003c/p\u003e\n\t  \u003cp\u003eTeam Yoast discovered that the user activation screen could be indexed by search\n\t    engines in some uncommon configurations, leading to exposure of email addresses,\n\t    and in some rare cases, default generated passwords.\u003c/p\u003e\n\t  \u003cp\u003eTim Coen and Slavco discovered that authors on Apache-hosted sites could upload\n\t    specifically crafted files that bypass MIME verification, leading to a cross-site\n\t    scripting vulnerability.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "wordpress",
      "range": [
        {
          "lt": "5.0.1,1"
        }
      ]
    },
    {
      "name": "fr-wordpress",
      "range": [
        {
          "lt": "5.0.1,1"
        }
      ]
    },
    {
      "name": "de-wordpress",
      "range": [
        {
          "lt": "5.0.1"
        }
      ]
    },
    {
      "name": "zh_CN-wordpress",
      "range": [
        {
          "lt": "5.0.1"
        }
      ]
    },
    {
      "name": "zh_TW-wordpress",
      "range": [
        {
          "lt": "5.0.1"
        }
      ]
    },
    {
      "name": "ja-wordpress",
      "range": [
        {
          "lt": "5.0.1"
        }
      ]
    },
    {
      "name": "ru-wordpress",
      "range": [
        {
          "lt": "5.0.1"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2018-12-13T00:00:00Z",
    "entry": "2018-12-15T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "https://wordpress.org/news/2018/12/wordpress-5-0-1-security-release/"
    }
  ]
}
