{
  "vid": "5d1d4473-b40d-11e5-9728-002590263bf5",
  "topic": "xen-tools -- libxl leak of pv kernel and initrd on error",
  "description": "\n\t\u003cp\u003eThe Xen Project reports:\u003c/p\u003e\n\t\u003cblockquote cite=\"http://xenbits.xen.org/xsa/advisory-160.html\"\u003e\n\t  \u003cp\u003eWhen constructing a guest which is configured to use a PV\n\t    bootloader which runs as a userspace process in the toolstack domain\n\t    (e.g. pygrub) libxl creates a mapping of the files to be used as\n\t    kernel and initial ramdisk when building the guest domain.\u003c/p\u003e\n\t  \u003cp\u003eHowever if building the domain subsequently fails these mappings\n\t    would not be released leading to a leak of virtual address space in\n\t    the calling process, as well as preventing the recovery of the\n\t    temporary disk files containing the kernel and initial ramdisk.\u003c/p\u003e\n\t  \u003cp\u003eFor toolstacks which manage multiple domains within the same\n\t    process, an attacker who is able to repeatedly start a suitable\n\t    domain (or many such domains) can cause an out-of-memory condition in the\n\t    toolstack process, leading to a denial of service.\u003c/p\u003e\n\t  \u003cp\u003eUnder the same circumstances an attacker can also cause files to\n\t    accumulate on the toolstack domain filesystem (usually under /var in\n\t    dom0) used to temporarily store the kernel and initial ramdisk,\n\t    perhaps leading to a denial of service against arbitrary other\n\t    services using that filesystem.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "xen-tools",
      "range": [
        {
          "lt": "4.5.2_1",
          "ge": "4.1"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2015-12-08T00:00:00Z",
    "entry": "2016-01-06T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "http://xenbits.xen.org/xsa/advisory-160.html"
    },
    {
      "source": "CVE",
      "text": "CVE-2015-8341"
    },
    {
      "source": "FreebsdPR",
      "text": "ports/205841"
    }
  ]
}
