{
  "vid": "61b07d71-ce0e-11dd-a721-0030843d3802",
  "topic": "mediawiki -- multiple vulnerabilities",
  "description": "\n\t\u003cp\u003eThe MediaWiki development team reports:\u003c/p\u003e\n\t\u003cblockquote cite=\"http://lists.wikimedia.org/pipermail/mediawiki-announce/2008-December/000080.html\"\u003e\n\t  \u003cp\u003eCertain unspecified input is not properly sanitised before being\n\t    returned to the user. This can be exploited to execute arbitrary HTML\n\t    and script code in a user's browser session in context of an affected\n\t    site.\u003c/p\u003e\n\t  \u003cp\u003eCertain unspecified input related to uploads is not properly\n\t    sanitised before being used. This can be exploited to inject arbitrary\n\t    HTML and script code, which will be executed in a user's browser\n\t    session in context of an affected site when a malicious data is\n\t    opened. Successful exploitation may require that uploads are enabled\n\t    and the victim uses an Internet Explorer based browser.\u003c/p\u003e\n\t  \u003cp\u003eCertain SVG scripts are not properly sanitised before being used.\n\t    This can be exploited to inject arbitrary HTML and script code, which\n\t    will be executed in a user's browser session in context of an affected\n\t    site when a malicious data is opened. Successful exploitation may require\n\t    that SVG uploads are enabled and the victim uses a browser supporting SVG\n\t    scripting.\u003c/p\u003e\n\t  \u003cp\u003eThe application allows users to perform certain actions via HTTP\n\t    requests without performing any validity checks to verify the\n\t    requests. This can be exploited to perform certain operations when a\n\t    logged in user visits a malicious site.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "mediawiki",
      "range": [
        {
          "lt": "1.6.11",
          "gt": "1.6.0"
        },
        {
          "lt": "1.12.3",
          "gt": "1.12.0"
        },
        {
          "lt": "1.13.3",
          "gt": "1.13.0"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2008-12-15T00:00:00Z",
    "entry": "2008-12-19T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "http://secunia.com/advisories/33133/"
    },
    {
      "source": "URL",
      "text": "http://lists.wikimedia.org/pipermail/mediawiki-announce/2008-December/000080.html"
    },
    {
      "source": "CVE",
      "text": "CVE-2008-5249"
    },
    {
      "source": "CVE",
      "text": "CVE-2008-5250"
    },
    {
      "source": "CVE",
      "text": "CVE-2008-5252"
    }
  ]
}
