{
  "vid": "6e8f9003-6007-11e6-a6c3-14dae9d210b8",
  "topic": "FreeBSD -- Incorrect error handling in PAM policy parser",
  "description": "\n\t\u003ch1\u003eProblem Description:\u003c/h1\u003e\n\t\u003cp\u003eThe OpenPAM library searches for policy definitions in\n\tseveral locations. While doing so, the absence of a policy\n\tfile is a soft failure (handled by searching in the next\n\tlocation) while the presence of an invalid file is a hard\n\tfailure (handled by returning an error to the caller).\u003c/p\u003e\n\t\u003cp\u003eThe policy parser returns the same error code (ENOENT)\n\twhen a syntactically valid policy references a non-existent\n\tmodule as when the requested policy file does not exist.\n\tThe search loop regards this as a soft failure and looks\n\tfor the next similarly-named policy, without discarding the\n\tpartially-loaded configuration.\u003c/p\u003e\n\t\u003cp\u003eA similar issue can arise if a policy contains an include\n\tdirective that refers to a non-existent policy.\u003c/p\u003e\n\t\u003ch1\u003eImpact:\u003c/h1\u003e\n\t\u003cp\u003eIf a module is removed, or the name of a module is\n\tmisspelled in the policy file, the PAM library will proceed\n\twith a partially loaded configuration. Depending on the\n\texact circumstances, this may result in a fail-open scenario\n\twhere users are allowed to log in without a password, or\n\twith an incorrect password.\u003c/p\u003e\n\t\u003cp\u003eIn particular, if a policy references a module installed\n\tby a package or port, and that package or port is being\n\treinstalled or upgraded, there is a brief window of time\n\tduring which the module is absent and policies that use it\n\tmay fail open. This can be especially damaging to Internet-facing\n\tSSH servers, which are regularly subjected to brute-force\n\tscans.\u003c/p\u003e\n      ",
  "affects": [
    {
      "name": "FreeBSD",
      "range": [
        {
          "lt": "9.2_7",
          "ge": "9.2"
        },
        {
          "lt": "10.0_4",
          "ge": "10.0"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2014-06-03T00:00:00Z",
    "entry": "2016-08-11T00:00:00Z"
  },
  "references": [
    {
      "source": "CVE",
      "text": "CVE-2014-3879"
    },
    {
      "source": "FreebsdSA",
      "text": "SA-14:13.pam"
    }
  ]
}
