{
  "vid": "be4b0529-dbaf-11dc-9791-000ea6702141",
  "topic": "clamav -- ClamAV libclamav PE File Integer Overflow Vulnerability",
  "description": "\n\t\u003cp\u003eiDefense Security Advisory 02.12.08:\u003c/p\u003e\n\t\u003cblockquote cite=\"http://labs.idefense.com/intelligence/vulnerabilities/display.php?id=658\"\u003e\n\t  \u003cp\u003eRemote exploitation of an integer overflow vulnerability\n\t    in Clam AntiVirus' ClamAV, as included in various vendors'\n\t    operating system distributions, allows attackers to execute\n\t    arbitrary code with the privileges of the affected process.\u003c/p\u003e\n\t  \u003cp\u003eThe vulnerability exists within the code responsible\n\t    for parsing and scanning PE files. While iterating through\n\t    all sections contained in the PE file, several attacker\n\t    controlled values are extracted from the file. On each iteration,\n\t    arithmetic operations are performed without taking into\n\t    consideration 32-bit integer wrap.\u003c/p\u003e\n\t  \u003cp\u003eSince insufficient integer overflow checks are present,\n\t    an attacker can cause a heap overflow by causing a specially\n\t    crafted Petite packed PE binary to be scanned. This results\n\t    in an exploitable memory corruption condition.\u003c/p\u003e\n\t  \u003cp\u003eExploitation of this vulnerability results in the\n\t    execution of arbitrary code with the privileges of the process\n\t    using libclamav. In the case of the clamd program, this will\n\t    result in code execution with the privileges of the clamav user.\n\t    Unsuccessful exploitation results in the clamd process crashing.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n\t\u003ch1\u003eWorkaround\u003c/h1\u003e\n\t\u003cp\u003eDisabling the scanning of PE files will prevent exploitation.\u003c/p\u003e\n\t\u003cp\u003eIf using clamscan, this can be done by running clamscan with the\n\t  '--no-pe' option.\u003c/p\u003e\n\t\u003cp\u003eIf using clamdscan, set the 'ScanPE' option in the clamd.conf\n\t  file to 'no'.\u003c/p\u003e\n      ",
  "affects": [
    {
      "name": "clamav",
      "range": [
        {
          "lt": "0.92.1",
          "ge": "0.92"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2008-01-07T00:00:00Z",
    "entry": "2008-02-15T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "http://labs.idefense.com/intelligence/vulnerabilities/display.php?id=658"
    },
    {
      "source": "URL",
      "text": "http://svn.clamav.net/svn/clamav-devel/trunk/ChangeLog"
    },
    {
      "source": "CVE",
      "text": "CVE-2008-0318"
    }
  ]
}
