{
  "vid": "c174118e-1b11-11ec-9d9d-0022489ad614",
  "topic": "Node.js -- July 2021 Security Releases",
  "description": "\n\t\u003cp\u003eNode.js reports:\u003c/p\u003e\n\t\u003cblockquote cite=\"https://nodejs.org/en/blog/vulnerability/july-2021-security-releases/\"\u003e\n\t  \u003ch1\u003elibuv upgrade - Out of bounds read (Medium) (CVE-2021-22918)\u003c/h1\u003e\n\t  \u003cp\u003eNode.js is vulnerable to out-of-bounds read in libuv's uv__idna_toascii() function which is used to convert strings to ASCII. This is called by Node's dns module's lookup() function and can lead to information disclosures or crashes.\u003c/p\u003e\n\t  \u003ch1\u003eWindows installer - Node Installer Local Privilege Escalation (Medium) (CVE-2021-22921)\u003c/h1\u003e\n\t  \u003cp\u003eNode.js is vulnerable to local privilege escalation attacks under certain conditions on Windows platforms. More specifically, improper configuration of permissions in the installation directory allows an attacker to perform two different escalation attacks: PATH and DLL hijacking.\u003c/p\u003e\n\t  \u003ch1\u003enpm upgrade - ssri Regular Expression Denial of Service (ReDoS) (High) (CVE-2021-27290)\u003c/h1\u003e\n\t  \u003cp\u003eThis is a vulnerability in the ssri npm module which may be vulnerable to denial of service attacks.\u003c/p\u003e\n\t  \u003ch1\u003enpm upgrade - hosted-git-info Regular Expression Denial of Service (ReDoS) (Medium) (CVE-2021-23362)\u003c/h1\u003e\n\t  \u003cp\u003eThis is a vulnerability in the hosted-git-info npm module which may be vulnerable to denial of service attacks.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "node14",
      "range": [
        {
          "lt": "14.17.2"
        }
      ]
    },
    {
      "name": "node",
      "range": [
        {
          "lt": "16.4.1"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2021-07-01T00:00:00Z",
    "entry": "2021-09-21T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "https://nodejs.org/en/blog/vulnerability/july-2021-security-releases/"
    },
    {
      "source": "CVE",
      "text": "CVE-2021-22918"
    },
    {
      "source": "CVE",
      "text": "CVE-2021-22921"
    },
    {
      "source": "CVE",
      "text": "CVE-2021-27290"
    },
    {
      "source": "CVE",
      "text": "CVE-2021-23362"
    }
  ]
}
