{
  "vid": "e3aacd6d-3d01-434c-9330-bc9efd40350f",
  "topic": "webkit-gtk -- Multiple vulnabilities",
  "description": "\n\t\u003cp\u003eThe Webkitgtk project reports:\u003c/p\u003e\n\t\u003cblockquote cite=\"https://webkitgtk.org/security/WSA-2019-0001.html\"\u003e\n\t  \u003cp\u003eCVE-2019-6212 - Processing maliciously crafted web content may lead to arbitrary code execution. Multiple memory corruption issues were addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6215 - Processing maliciously crafted web content may lead to arbitrary code execution. A type confusion issue was addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6216 - Processing maliciously crafted web content may lead to arbitrary code execution. Multiple memory corruption issues were addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6217 - Processing maliciously crafted web content may lead to arbitrary code execution. Multiple memory corruption issues were addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6226 - Processing maliciously crafted web content may lead to arbitrary code execution. Multiple memory corruption issues were addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6227 - Processing maliciously crafted web content may lead to arbitrary code execution. A memory corruption issue was addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6229 - Processing maliciously crafted web content may lead to universal cross site scripting. A logic issue was addressed with improved validation.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6233 - Processing maliciously crafted web content may lead to arbitrary code execution. A memory corruption issue was addressed with improved memory handling.\u003c/p\u003e\n\t  \u003cp\u003eCVE-2019-6234 - Processing maliciously crafted web content may lead to arbitrary code execution. A memory corruption issue was addressed with improved memory handling.\u003c/p\u003e\n\t\u003c/blockquote\u003e\n      ",
  "affects": [
    {
      "name": "webkit2-gtk3",
      "range": [
        {
          "lt": "2.22.6"
        }
      ]
    },
    {
      "name": "webkit-gtk2",
      "range": [
        {
          "ge": "0"
        }
      ]
    },
    {
      "name": "webkit-gtk3",
      "range": [
        {
          "ge": "0"
        }
      ]
    }
  ],
  "dates": {
    "discovery": "2019-02-08T00:00:00Z",
    "entry": "2019-02-24T00:00:00Z"
  },
  "references": [
    {
      "source": "URL",
      "text": "https://webkitgtk.org/security/WSA-2019-0001.html"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6212"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6215"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6216"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6217"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6226"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6227"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6229"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6233"
    },
    {
      "source": "CVE",
      "text": "CVE-2019-6234"
    }
  ]
}
